Revit 2024 API
TransactionGroup Methods
The TransactionGroup type exposes the following members.
Methods
Name | Description
Assimilate
 Assimilates all inner transactions by merging them into a single undo item.
Commit
 Commits the transaction group.
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetName
 Returns the transaction group's name. It could be an empty string.
GetStatus
 Gets the current status of the transaction group.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
HasEnded
 Determines whether the transaction group has ended already.
HasStarted
 Determines whether the transaction has been started yet.
RollBack
 Rolls back the transaction group, which effectively undoes all transactions committed inside the group.
SetName
 Sets the transaction group's name.
Start()
 Starts the transaction group
Start(String)
 Starts the transaction group with an assigned name.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
TransactionGroup Class
Autodesk.Revit.DB Namespace